# task_1
print('task_1')

x = int(input('Введіть ціле трицифрове число: '))
a = x % 10
b = (x % 100) // 10
c = x // 100
print('Добуток: ', a * b * c)

# task_2
print()
print('task_2')

X = int(input('Введіть ціле чотирицифрове число: '))
A = X % 10
B = (X % 100) // 10
C = (X % 1000) // 100
D = X // 1000
print('Сума першої і останньої цифр:', A + D)
print('Сума середніх цифр:', B + C)

# task_3
print()
print('task_3')

y = float(input('Введіть дійсне число: '))
e = int(y % 10)
f = int((y * 1000) % 10)
print('Остання цифра цілої частини: ', e)
print('Третя цифра дробової частини: ', f)
print()